# SOAL

1. Cari nilai ukuran pemusatan dan ukuran penyebaran datanya (statistik deskriptif)
2. serta lakukan pengujian hipotesis untuk membuktikan apakah education berpengaruh terhadap income atau tidak?

# Import Library dan Drive Online

In [ ]:
import pandas as pd
import numpy as np
import scipy.stats as st
import matplotlib.pyplot as plt

In [ ]:
from google.colab import drive
drive.mount("/content/gdrive")

Mounted at /content/gdrive

# **Soal 1.**

### Ukuran Pemusatan Data

In [ ]:
df = df = pd.read_csv('/content/gdrive/MyDrive/data science/marketing_campaign.csv', sep="\t") #inport data frame
df['Income']=df.Income.fillna(df.Income.mean()) #mengisi nilai nan di income dengan rata-rata
df #menampilkan data frame

,ID,Year_Birth,Education,Marital_Status,Income,Kidhome,Teenhome,Dt_Customer,Recency,MntWines,...,NumWebVisitsMonth,AcceptedCmp3,AcceptedCmp4,AcceptedCmp5,AcceptedCmp1,AcceptedCmp2,Complain,Z_CostContact,Z_Revenue,Response
0,5524,1957,Graduation,Single,58138.0,0,0,04-09-2012,58,635,...,7,0,0,0,0,0,0,3,11,1
1,2174,1954,Graduation,Single,46344.0,1,1,08-03-2014,38,11,...,5,0,0,0,0,0,0,3,11,0
2,4141,1965,Graduation,Together,71613.0,0,0,21-08-2013,26,426,...,4,0,0,0,0,0,0,3,11,0
3,6182,1984,Graduation,Together,26646.0,1,0,10-02-2014,26,11,...,6,0,0,0,0,0,0,3,11,0
4,5324,1981,PhD,Married,58293.0,1,0,19-01-2014,94,173,...,5,0,0,0,0,0,0,3,11,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
2235,10870,1967,Graduation,Married,61223.0,0,1,13-06-2013,46,709,...,5,0,0,0,0,0,0,3,11,0
2236,4001,1946,PhD,Together,64014.0,2,1,10-06-2014,56,406,...,7,0,0,0,1,0,0,3,11,0
2237,7270,1981,Graduation,Divorced,56981.0,0,0,25-01-2014,91,908,...,6,0,1,0,0,0,0,3,11,0
2238,8235,1956,Master,Together,69245.0,0,1,24-01-2014,8,428,...,3,0,0,0,0,0,0,3,11,0
2239,9405,1954,PhD,Married,52869.0,1,1,15-10-2012,40,84,...,7,0,0,0,0,0,0,3,11,1

In [ ]:
# menampilkan value unik dan menampilkan totalnya per value pada variabel terentu
np.unique(df['Education'], return_counts=True)

(array(['2n Cycle', 'Basic', 'Graduation', 'Master', 'PhD'], dtype=object),
 array([ 203,   54, 1127,  370,  486]))

In [ ]:
# ini adalah ukuran pemusatan dari income

# round adalah untuk hanya menampilkan 2 angka di blkang koma, dijelaskan dengan angka 2
print("Mencari Mean Income Menggunakan Numpy \t\t\t:", round(np.mean(df['Income']),2))
print("Mencari Median Income Menggunakan Numpy \t\t:", np.median(df['Income']))
print("Mencari Mode/Modus Income Menggunakan Scipy.stat \t:", st.mode(df['Income']))


val, count = st.mode(df['Income']) # output akan melihat dua nilai, pertama adalah nilai mode, kedua adalah hitungan mode itu
print('Mode dari Income adalah \t\t\t\t:', round(val[0],2)) # value mode
print('Frekuensi mode mucul dari Income adalah \t\t:', count[0]) # frekuensi mode/modus
print(df.shape) # menunjukkan jumlah baris dan kolom

Mencari Mean Income Menggunakan Numpy 			: 52247.25
Mencari Median Income Menggunakan Numpy 		: 51741.5
Mencari Mode/Modus Income Menggunakan Scipy.stat 	: ModeResult(mode=array([52247.25135379]), count=array([24]))
Mode dari Income adalah 				: 52247.25
Frekuensi mode mucul dari Income adalah 		: 24
(2240, 29)

### Ukuran Penyebaran Data

1. variance 
2. standart deviation
3. range
4. quartile

In [ ]:
print("Mencari Variance Income Menggunakan Numpy \t\t:", np.var(df['Income']))
print("Mencari Standard Deviation Income Menggunakan Numpy \t:", np.std(df['Income']))
print("Mencari Range Income Menggunakan Numpy \t\t\t:", max(df['Income']) - min(df['Income']))  # semakin besar Range maka datanya semakin tersebar

#ini quartile
q1 = np.quantile(df['Income'], 0.25)
q2 = np.quantile(df['Income'], 0.5) #q2 sama seperti median
q3 = np.quantile(df['Income'], 0.75)

print("Quartil ke-1 dari Income adalah \t\t\t:", q1)
print("Quartil ke-2 dari Income adalah \t\t\t:", q2)
print("Quartil ke-3 dari Income adalah \t\t\t:", q3)

Mencari Variance Income Menggunakan Numpy 		: 626611424.8638378
Mencari Standard Deviation Income Menggunakan Numpy 	: 25032.207750492922
Mencari Range Income Menggunakan Numpy 			: 664936.0
Quartil ke-1 dari Income adalah 			: 35538.75
Quartil ke-2 dari Income adalah 			: 51741.5
Quartil ke-3 dari Income adalah 			: 68289.75

# **Soal 2.**

saya tidak menggunaka teknik sampling karena dataframe yang ada masih mampu di handle langsung oleh komputer saya sehingga tidak memperlukan teknik sampling dan untuk tujuan agar hasil test dapat lebih mempresentasikan nilai sebenarnya dari data.

### Tes Hipotesis, Perhitungan dan Kesimpulan

#### Langkah 1 (Hipotesa)

Usage The Greek letter μ (mu) is used in statistics to represent the population mean of a distribution

*   H0 : μ1 = μ2 = μ3 = μ4
*   H1 : μi ≠ μj, i,j = 1,2,3,4

atau 

*   H0 : μ_merah = μ_biru = μ_kuning = μ_hijau
*   H1 : μi ≠ μj, i,j = merah, biru, Kuning, hijau i≠j

Contoh : jika ada perbedaan antar nilai μ (mu), maka H1 diterima atau berpengaruh (warna berpengaruh)

Berikut hipotesis dari soal: 

*   H0 : μ_graduation = μ_phd = μ_master = μ_2nCycle = μ_basic
*   H1 : μi ≠ μj, i,j = graduation, phd, master, 2nCycle, basic i≠j

yakni :

*   H0 : Education tidak berpengaruh terhadap Income
*   H1 : Education berpengaruh terhadap Income

####Langkah 2 (Perhitungan)

In [ ]:
# untuk melihat value unik di varibel Education
df['Education'].value_counts()

Graduation    1127
PhD            486
Master         370
2n Cycle       203
Basic           54
Name: Education, dtype: int64

In [ ]:
df_graduation = df[df['Education'] == 'Graduation']
df_phd = df[df['Education'] == 'PhD']
df_master = df[df['Education'] == 'Master']
df_2nc = df[df['Education'] == '2n Cycle']
df_basic = df[df['Education'] == 'Basic']

In [ ]:
# ANOVA TEST
anova_test = st.f_oneway(df_graduation['Income'],
                         df_phd['Income'],
                         df_master['Income'],
                         df_2nc['Income'],
                         df_basic['Income'])

In [ ]:
# nilai P-VALUE
anova_test.pvalue

1.0531133036234708e-22

In [ ]:
# perbandingan P-value terhadap Alpha
if anova_test.pvalue>0.05:
    print('Income memiliki rata-rata yang sama')
else:
    print('Income memiliki rata-rata  yang berbeda signifikan')

Income memiliki rata-rata  yang berbeda signifikan

In [ ]:
df.groupby(['Education'])['Income'].mean()

Education
2n Cycle      47701.378099
Basic         20306.259259
Graduation    52715.755781
Master        52908.476370
PhD           56105.210405
Name: Income, dtype: float64

####Langkah 3 (Kesimpulan)

Karena ada rata-rata yang beda signifikan  dan P-value < 0,05 maka kesimpulannya adalah Education berpengaruh terhadap Income